{
  "_name_or_path": "microsoft/layoutlmv3-base",
  "architectures": [
    "LayoutLMv3ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "coordinate_size": 128,
  "eos_token_id": 2,
  "has_relative_attention_bias": true,
  "has_spatial_attention_bias": true,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-B-ADDRESS",
    "1": "B-B-NAME",
    "2": "B-INVOICE NO",
    "3": "B-ORDER DATE",
    "4": "B-S-ADDRESS",
    "5": "B-S-NAME",
    "6": "B-TOTAL GROSS",
    "7": "E-B-ADDRESS",
    "8": "E-B-NAME",
    "9": "E-INVOICE NO",
    "10": "E-ORDER DATE",
    "11": "E-S-ADDRESS",
    "12": "E-S-NAME",
    "13": "E-TOTAL GROSS",
    "14": "I-B-ADDRESS",
    "15": "I-B-NAME",
    "16": "I-INVOICE NO",
    "17": "I-ORDER DATE",
    "18": "I-S-ADDRESS",
    "19": "I-S-NAME",
    "20": "O",
    "21": "S-B-ADDRESS",
    "22": "S-B-NAME",
    "23": "S-GST NO",
    "24": "S-INVOICE NO",
    "25": "S-ORDER DATE",
    "26": "S-ORDER NO",
    "27": "S-S-ADDRESS",
    "28": "S-TOTAL GROSS"
  },
  "initializer_range": 0.02,
  "input_size": 224,
  "intermediate_size": 3072,
  "label2id": {
    "B-B-ADDRESS": 0,
    "B-B-NAME": 1,
    "B-INVOICE NO": 2,
    "B-ORDER DATE": 3,
    "B-S-ADDRESS": 4,
    "B-S-NAME": 5,
    "B-TOTAL GROSS": 6,
    "E-B-ADDRESS": 7,
    "E-B-NAME": 8,
    "E-INVOICE NO": 9,
    "E-ORDER DATE": 10,
    "E-S-ADDRESS": 11,
    "E-S-NAME": 12,
    "E-TOTAL GROSS": 13,
    "I-B-ADDRESS": 14,
    "I-B-NAME": 15,
    "I-INVOICE NO": 16,
    "I-ORDER DATE": 17,
    "I-S-ADDRESS": 18,
    "I-S-NAME": 19,
    "O": 20,
    "S-B-ADDRESS": 21,
    "S-B-NAME": 22,
    "S-GST NO": 23,
    "S-INVOICE NO": 24,
    "S-ORDER DATE": 25,
    "S-ORDER NO": 26,
    "S-S-ADDRESS": 27,
    "S-TOTAL GROSS": 28
  },
  "layer_norm_eps": 1e-05,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 514,
  "max_rel_2d_pos": 256,
  "max_rel_pos": 128,
  "model_type": "layoutlmv3",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "patch_size": 16,
  "rel_2d_pos_bins": 64,
  "rel_pos_bins": 32,
  "second_input_size": 112,
  "shape_size": 128,
  "text_embed": true,
  "torch_dtype": "float32",
  "transformers_version": "4.44.2",
  "type_vocab_size": 1,
  "visual_embed": true,
  "vocab_size": 50265
}
